# Length Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTrayConduitRunBase..::..Length Property
CableTrayConduitRunBase Class See Also
---
The length of the whole (cable tray or conduit) run default 0.0
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Length { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Length As Double
	Get
```

Visual C++
---
```text
public:
property double Length {
	double get ();
}
```

# See Also
CableTrayConduitRunBase Class
Autodesk.Revit.DB.Electrical Namespace